# Rebar Bending Detail Type Angular Dimensions For Cranks Enabled Property

Source: https://www.revitapidocs.com/2026/e2043d9b-87f9-6bc8-6302-abef51f974b5.htm

---

| Rebar Bending Detail Type Angular Dimensions For Cranks Enabled Property |
| --- |

Identifies if the angular dimensions which has a reference set on a crank will be shown or not.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool AngularDimensionsForCranksEnabled { get; set; }
```

```
Public Property AngularDimensionsForCranksEnabled As Boolean
	Get
	Set
```

```
public:
property bool AngularDimensionsForCranksEnabled {
	bool get ();
	void set (bool value);
}
```

```
member AngularDimensionsForCranksEnabled : bool with get, set
```

#### Property Value

Boolean See Also

#### Reference

RebarBendingDetailType Class Autodesk.Revit.DB.Structure Namespace